/*#############################################################################
 * 文件名：floatfield.h
 * 功能：  实现了指纹结构浮点域的操作
 * modified by  PRTsinghua@hotmail.com
#############################################################################*/

#if !defined FVS__FLOAT_FIELD_HEADER__INCLUDED__
#define FVS__FLOAT_FIELD_HEADER__INCLUDED__


/* 基本类型的定义文件 */
#include "fvstypes.h"


/* 对象的这些接口实现是私有的，不必为用户所知。使用这里提供的函数操作浮点域 */
typedef FvsHandle_t FvsFloatField_t;


/******************************************************************************
  * 功能：创建一个心的浮点域对象
  * 参数：无
  * 返回：创建失败，返回空；否则返回新的对象句柄
******************************************************************************/
FvsFloatField_t FloatFieldCreate(void);


/******************************************************************************
  * 功能：破坏已经存在的浮点域对象
  * 参数：field   指向浮点域对象的指针
  * 返回：无
******************************************************************************/
void FloatFieldDestroy(FvsFloatField_t field);

 
/******************************************************************************
  * 功能：设置浮点域对象的大小。
          内存操作自动完成，如果失败，返回一个错误编号
  * 参数：field   指向浮点域对象的指针
  *       width   宽
  *       height  高
  * 返回：错误编号
******************************************************************************/
FvsError_t FloatFieldSetSize(FvsFloatField_t field, const FvsInt_t width, 
			const FvsInt_t height);


/******************************************************************************
  * 功能：拷贝一个源图像到目标图像，内存操作和大小重置操作自动完成
  * 参数：destination 指向目标浮点域对象的指针
  *       source      指向源浮点域对象的指针
  * 返回：错误编号
******************************************************************************/
FvsError_t FloatFieldCopy(FvsFloatField_t destination, 
			const FvsFloatField_t source);


/******************************************************************************
  * 功能：清空图像，设置浮点域对象指针为空
  * 参数：field 指向浮点域对象的指针
  * 返回：错误编号
******************************************************************************/
FvsError_t FloatFieldClear(FvsFloatField_t field);


/******************************************************************************
  * 功能：给浮点域对象的所以数值设置特定值
  * 参数：field  指向浮点域对象的指针
  *       value  要设置的值
  * 返回：错误编号
******************************************************************************/
FvsError_t FloatFieldFlood(FvsFloatField_t field, const FvsFloat_t value);


/******************************************************************************
  * 功能：为浮点域中的特定区域设置特定值
  * 参数：field  指向浮点域对象的指针
  *       x      X轴坐标
  *       y      Y轴坐标
  *       val    要设定的值
  * 返回：无
******************************************************************************/
void FloatFieldSetValue(FvsFloatField_t field, const FvsInt_t x, 
			const FvsInt_t y, const FvsFloat_t val);


/******************************************************************************
  * 功能：得到特定位置的值
  * 参数：field  指向浮点域对象的指针
  *       x      X轴坐标
  *       y      Y轴坐标
  * 返回：浮点值
******************************************************************************/
FvsFloat_t FloatFieldGetValue(const FvsFloatField_t field, const FvsInt_t x, 
			const FvsInt_t y);


/******************************************************************************
  * 功能：得到浮点域缓冲区指针
  * 参数：field  指向浮点域对象的指针
  * 返回：内存缓冲区指针
******************************************************************************/
FvsFloat_t* FloatFieldGetBuffer(FvsFloatField_t field);


/******************************************************************************
  * 功能：获得宽度
  * 参数：field  指向浮点域对象的指针
  * 返回：宽度
******************************************************************************/
FvsInt_t FloatFieldGetWidth(const FvsFloatField_t field);


/******************************************************************************
  * 功能：获得高度
  * 参数：field  指向浮点域对象的指针
  * 返回：高度
******************************************************************************/
FvsInt_t FloatFieldGetHeight(const FvsFloatField_t field);


/******************************************************************************
  * 功能：获得倾斜程度
  * 参数：field  指向浮点域对象的指针
  * 返回：倾斜程度
******************************************************************************/
FvsInt_t FloatFieldGetPitch(const FvsFloatField_t field);


#endif /* FVS__IMAGE_HEADER__INCLUDED__ */

